jonacappelle/nRF52-BLE-IMU/BLE/usr_ble.c
/*  ____  ____      _    __  __  ____ ___
 * |  _ \|  _ \    / \  |  \/  |/ ___/ _ \
 * | | | | |_) |  / _ \ | |\/| | |  | | | |
 * | |_| |  _ <  / ___ \| |  | | |__| |_| |
 * |____/|_| \_\/_/   \_\_|  |_|\____\___/
 *                           research group
 *                             dramco.be/
 *
 *  KU Leuven - Technology Campus Gent,
 *  Gebroeders De Smetstraat 1,
 *  B-9000 Gent, Belgium
 *
 *         File: usr_ble.c
 *      Created: 2022-03-01
 *       Author: Jona Cappelle
 *      Version: 1.0
 *
 *  Description: Bluetooth Low Energy communication
 *
 *  Commissiond by Interreg NOMADe
 *
 */


#include "usr_ble.h"

// Include utilities
#include "usr_util.h"

#include "usr_ble_settings.h"

#include "settings.h"

#include <stdint.h>
#include <string.h>
#include "nordic_common.h"
#include "nrf.h"
#include "ble_hci.h"
#include "ble_advdata.h"
#include "ble_advertising.h"
#include "ble_conn_params.h"
#include "nrf_sdh.h"
#include "nrf_sdh_soc.h"
#include "nrf_sdh_ble.h"
#include "nrf_ble_gatt.h"
#include "nrf_ble_qwr.h"
#include "app_timer.h"
#include "app_uart.h"
#include "app_util_platform.h"
#include "bsp_btn_ble.h"
#include "nrf_pwr_mgmt.h"

#if defined (UART_PRESENT)
#include "nrf_uart.h"
#endif
#if defined (UARTE_PRESENT)
#include "nrf_uarte.h"
#endif



#define NRF_LOG_MODULE_NAME usr_ble
#define NRF_LOG_LEVEL 4
#include "nrf_log.h"
NRF_LOG_MODULE_REGISTER();

#include "nrf_log.h"
#include "nrf_log_ctrl.h"
#include "nrf_log_default_backends.h"

#include "nrf_delay.h"


#include "usr_gpio.h"

// TimeSync
#include "time_sync.h"
#include "nrf_gpiote.h"
#include "nrf_ppi.h"
#include "nrf_timer.h"

// Timers
#include "usr_tmr.h"

// IMU params
#include "imu.h"
extern imu_data_t imu_data;

// Application scheduler
#include "app_scheduler.h"

// Add Motion service for transmitting IMU data
#include "ble_motion_service.h"

// BLE Battery service
#include "ble_bas.h"

// ADC
#include "usr_adc.h"

#include <stdbool.h>
#include <stdint.h>
#include <string.h>

#include "nrf_dfu_ble_svci_bond_sharing.h"
#include "nrf_svci_async_function.h"
#include "nrf_svci_async_handler.h"

#include "nordic_common.h"
#include "nrf.h"
#include "app_error.h"
#include "ble.h"
#include "ble_hci.h"
#include "ble_srv_common.h"
#include "ble_advdata.h"
#include "ble_advertising.h"
#include "ble_conn_params.h"
#include "nrf_sdh.h"
#include "nrf_sdh_soc.h"
#include "nrf_sdh_ble.h"
#include "app_timer.h"
#include "peer_manager.h"
#include "peer_manager_handler.h"
#include "bsp_btn_ble.h"
#include "ble_hci.h"
#include "ble_advdata.h"
#include "ble_advertising.h"
#include "ble_conn_state.h"
#include "ble_dfu.h"
#include "nrf_ble_gatt.h"
#include "nrf_ble_qwr.h"
#include "fds.h"
#include "nrf_pwr_mgmt.h"
#include "nrf_drv_clock.h"
#include "nrf_power.h"
#include "nrf_log.h"
#include "nrf_log_ctrl.h"
#include "nrf_log_default_backends.h"
#include "nrf_bootloader_info.h"


extern bool calibration_timer_running;

ble_tms_config_t tms_cfg;

static bool calibration_started = false;

uint64_t data_sampling_time_start = 0;

// Struct to keep track of TimeSync variables
typedef struct{
    uint32_t sync_interval_int_time; // How much time between measurements - (In increments of 2.5 ms)
    bool m_ts_synchronized;
    bool m_imu_trigger_enabled;
    bool m_ts_packet_received;
} time_sync_t;



time_sync_t ts = {
    .sync_interval_int_time = 4, // Default 100 Hz transmission rate
    .m_ts_synchronized = 0,
    .m_imu_trigger_enabled = 0,
    .m_ts_packet_received = 0,
};

ts_rf_config_t rf_config =
{
    .rf_chn = 80,
    .rf_addr = { 0xDE, 0xAD, 0xBE, 0xEF, 0x19 }
    // .rf_addr = {0xAA, 0xBB, 0xCC, 0xDD, 0xEE} // set debug
    // .rf_addr = {0x73, 0x65, 0x74, 0x5F, 0x31} // set_1 in ascii
    // .rf_addr = {0x73, 0x65, 0x74, 0x5F, 0x32} // set_2 in ascii
    // .rf_addr = {0x73, 0x65, 0x74, 0x5F, 0x33} // set_3 in ascii
    // .rf_addr = {0x73, 0x65, 0x74, 0x5F, 0x34} // set_4 in ascii
    // .rf_addr = {0x73, 0x65, 0x74, 0x5F, 0x35} // set_5 in ascii
    // .rf_addr = {0x73, 0x65, 0x74, 0x5F, 0x36} // set_6 in ascii
    // .rf_addr = {0x73, 0x65, 0x74, 0x5F, 0x37} // set_7 in ascii
    // .rf_addr = {0x73, 0x65, 0x74, 0x5F, 0x38} // set_8 in ascii
    // .rf_addr = {0x73, 0x65, 0x74, 0x5F, 0x39} // set_9 in ascii
    // .rf_addr = {0x73, 0x65, 0x74, 0x5F, 0x40} // set_10 in ascii
};


// Initialization
NRF_BLE_GATT_DEF(m_gatt);                                                           /**< GATT module instance. */
NRF_BLE_QWR_DEF(m_qwr);                                                             /**< Context for the Queued Write module.*/
BLE_ADVERTISING_DEF(m_advertising);                                                 /**< Advertising module instance. */

BLE_BAS_DEF(m_bas);                                                                 /**< Structure used to identify the battery service. */
ble_tms_t m_tms;                                                                    /**< Motion service */

static uint16_t   m_conn_handle          = BLE_CONN_HANDLE_INVALID;                 /**< Handle of the current connection. */

static ble_uuid_t m_adv_uuids[]          =                                          /**< Universally unique service identifier. */
{
    {BLE_UUID_TMS_SERVICE, MOTION_SERVICE_UUID_TYPE}, // Added for TMS service
    {BLE_UUID_BATTERY_SERVICE, BLE_UUID_TYPE_BLE}
};


// Function prototypes
static bool ts_evt_synchronized();



void ble_send_quat(ble_tms_quat_t * data)
{
    ret_code_t err_code;

    if(m_conn_handle != BLE_CONN_HANDLE_INVALID)
    {
        err_code = ble_tms_quat_set(&m_tms, data);
        if(err_code != NRF_SUCCESS)
        {
            if(err_code == NRF_ERROR_RESOURCES)
            {
                NRF_LOG_INFO("Packet lost");
            }else{
                NRF_LOG_INFO("ble_tms_quat_set err_code: %d", err_code);
                APP_ERROR_CHECK(err_code);            
            }
        }
    }
}

void ble_send_raw(ble_tms_raw_t * data)
{
    ret_code_t err_code;

    if(m_conn_handle != BLE_CONN_HANDLE_INVALID)
    {
        err_code = ble_tms_raw_set(&m_tms, data);	
        if(err_code != NRF_SUCCESS)
        {
            NRF_LOG_INFO("ble_tms_raw_set err_code: %d", err_code);
            APP_ERROR_CHECK(err_code);
        }    
    }
}

