jonacappelle/nRF52-BLE-IMU/BLE/usr_ble.c
void ble_send_adc(ble_tms_adc_t * data)
{
    ret_code_t err_code;

    if(m_conn_handle != BLE_CONN_HANDLE_INVALID)
    {
        err_code = ble_tms_adc_set(&m_tms, data);
        if(err_code != NRF_SUCCESS)
        {
            NRF_LOG_INFO("ble_tms_adc_set err_code: %d", err_code);
        } 
    }
}

void ble_send_euler(ble_tms_euler_t * data)
{
    ret_code_t err_code;

    if(m_conn_handle != BLE_CONN_HANDLE_INVALID)
    {
        err_code = ble_tms_euler_set(&m_tms, data);
        if(err_code != NRF_SUCCESS)
        {
            NRF_LOG_INFO("ble_tms_euler_set err_code: %d", err_code);
        }
    }
}


// Print received config
static void print_config(ble_tms_config_t* config)
{
    NRF_LOG_INFO("---RECEIVED CONFIG---")

    if(config->gyro_enabled) NRF_LOG_INFO("Gyro enabled");
    if(config->accel_enabled) NRF_LOG_INFO("Accel enabled");
    if(config->mag_enabled) NRF_LOG_INFO("Mag enabled");
    if(config->euler_enabled) NRF_LOG_INFO("Euler enabled");
    if(config->quat6_enabled) NRF_LOG_INFO("QUAT6 enabled");
    if(config->quat9_enabled) NRF_LOG_INFO("QUAT9 enabled");
    if(config->start_calibration) NRF_LOG_INFO("Calibration start enabled");
    NRF_LOG_INFO("Frequency: %d", config->motion_freq_hz);

    if(config->adc_enabled) NRF_LOG_INFO("ADC enabled");

    if(config->sync_enabled) NRF_LOG_INFO("SYNC enabled");
    NRF_LOG_INFO("Sync start time: %d", config->sync_start_time);

    if(config->wom_enabled) NRF_LOG_INFO("WoM enabled");

    NRF_LOG_FLUSH();
}



void sync_notif(void * p_event_data, uint16_t event_size)
{
    // Notify DCU that time is synced
    if(ts_evt_synchronized())
    {
        NRF_LOG_INFO("sync_info_send conn_handle: %d", m_conn_handle);
        sync_info_send(true);
    }
}


// Motion service event handler
static void ble_tms_evt_handler(ble_tms_t        * p_tms,
                                ble_tms_evt_type_t evt_type,
                                uint8_t          * p_data,
                                uint16_t           length)
{
    NRF_LOG_DEBUG("ble_tms_evt_handler called: %d", evt_type);
    ret_code_t err_code;
    
    switch (evt_type)
    {
        case BLE_TMS_EVT_NOTIF_ADC:
            NRF_LOG_INFO("ble_tms_evt_handler: BLE_TMS_EVT_NOTIF_ADC - %d\r\n", p_tms->is_adc_notif_enabled);
            break;

        case BLE_TMS_EVT_NOTIF_QUAT:
            NRF_LOG_INFO("ble_tms_evt_handler: BLE_TMS_EVT_NOTIF_QUAT - %d\r\n", p_tms->is_quat_notif_enabled);
            break;

        case BLE_TMS_EVT_NOTIF_RAW:
            NRF_LOG_INFO("ble_tms_evt_handler: BLE_TMS_EVT_NOTIF_RAW - %d\r\n", p_tms->is_raw_notif_enabled);
            break;

        case BLE_TMS_EVT_NOTIF_EULER:
            NRF_LOG_INFO("ble_tms_evt_handler: BLE_TMS_EVT_NOTIF_EULER - %d\r\n", p_tms->is_euler_notif_enabled);
            break;

        case BLE_TMS_EVT_NOTIF_INFO:
            NRF_LOG_INFO("ble_tms_evt_handler: BLE_TMS_EVT_NOTIF_INFO - %d\r\n", p_tms->is_info_notif_enabled);

            // Pass change IMU settings to event handler
            err_code = app_sched_event_put(0, 0, sync_notif);
            APP_ERROR_CHECK(err_code);

            break;

        case BLE_TMS_EVT_CONFIG_RECEIVED:
            NRF_LOG_INFO("ble_tms_evt_handler: BLE_TMS_EVT_CONFIG_RECEIVED - %d\r\n", length);
            APP_ERROR_CHECK_BOOL(length == sizeof(ble_tms_config_t));

            // Init struct for storing received data
            memcpy(&tms_cfg, p_data, length);

            // If wake on motion command is received
            // - Break the BLE connection
            // - Turn of wake-on-motion
            // - Setup interrupt pin to wake-up microcontroller
            if (tms_cfg.wom_enabled)
            {
                NRF_LOG_INFO("in if() statement");
                ble_disconnect();
            }

            // Keep track of when calibration has been started
            calibration_started = tms_cfg.start_calibration;

            // Print out received config over RTT
            print_config(&tms_cfg);

            // Pass change IMU settings to event handler
            err_code = app_sched_event_put(&tms_cfg, sizeof(tms_cfg), imu_config_evt_sceduled);
            APP_ERROR_CHECK(err_code);
            break;

        default:
            break;
    }
}




void batt_level_update(uint8_t battery_level)
{
    ret_code_t err_code;

    err_code = ble_bas_battery_level_update(&m_bas, battery_level, BLE_CONN_HANDLE_ALL);
    if ((err_code != NRF_SUCCESS) &&
        (err_code != NRF_ERROR_INVALID_STATE) &&
        (err_code != NRF_ERROR_RESOURCES) &&
        (err_code != NRF_ERROR_BUSY) &&
        (err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING)
       )
    {
        APP_ERROR_CHECK(err_code);
    }
}




/**@brief Function for handling Queued Write Module errors.
 *
 * @details A pointer to this function will be passed to each service which may need to inform the
 *          application about an error.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void nrf_qwr_error_handler(uint32_t nrf_error)
{
    APP_ERROR_CHECK(nrf_error);
}



/**@brief Function for the GAP initialization.
 *
 * @details This function will set up all the necessary GAP (Generic Access Profile) parameters of
 *          the device. It also sets the permissions and appearance.
 */
static void gap_params_init(void)
{
    uint32_t                err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *) DEVICE_NAME,
                                          strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);
}


static void ts_print_sync_time()
{
    uint64_t time_now_ticks;
    uint32_t time_now_msec;
    uint32_t time_ticks;

    time_now_ticks = ts_timestamp_get_ticks_u64();
    time_now_msec = TIME_SYNC_TIMESTAMP_TO_USEC(time_now_ticks) / 1000;
    time_ticks = TIME_SYNC_MSEC_TO_TICK(time_now_msec);
    NRF_LOG_INFO("Time: ticks %d - ms %d", time_ticks, time_now_msec);
}

static void ts_set_triggered_period(ble_tms_config_t* self)
{
    if(self->motion_freq_hz == 0)
    {
        NRF_LOG_INFO("Wrong frequency selected - set to default 0Hz");
        ts.sync_interval_int_time = (FREQ_TO_MS(100) / TIME_SYNC_TIMER_PERIOD_MS);
    }else{
        ts.sync_interval_int_time = (FREQ_TO_MS(self->motion_freq_hz) / TIME_SYNC_TIMER_PERIOD_MS);
    }
}


static void ts_start_trigger(ble_tms_config_t* p_evt)
{
    ret_code_t err_code;

    // Set timesync pin low
    led_off();

    // Print start time
    NRF_LOG_INFO("time.sync_start_time %d", p_evt->sync_start_time);

    if( ( p_evt->sync_enabled ) && ( p_evt->sync_start_time != 0) )
    {
        err_code = ts_set_trigger(p_evt->sync_start_time, nrf_gpiote_task_addr_get(NRF_GPIOTE_TASKS_OUT_3));
        APP_ERROR_CHECK(err_code);
        ts.m_imu_trigger_enabled = 1;

        // Set start data sampling time
        data_sampling_time_start = p_evt->sync_start_time;

    }else{
        ts.m_imu_trigger_enabled = 0;
    }
    NRF_LOG_INFO("ts.sync_interval_int_time: %d", ts.sync_interval_int_time);
}



// Event handler DIY
/**@brief GPIOTE sceduled handler, executed in main-context.
 */
void imu_config_evt_sceduled(void * p_event_data, uint16_t event_size)
{
		// Enable sensor parameters based on received configuration
		ret_code_t err_code;

