jonacappelle/nRF52-BLE-IMU/BLE/usr_ble.c
            // TODO need to enter sleep mode
            // sleep_mode_enter();
            // idle_state_handle();

            err_code = app_sched_event_put(0, 0, sleep);
            APP_ERROR_CHECK(err_code);
            break;
        default:
            break;
    }
}

static void imu_clear_struct(ble_tms_config_t* data)
{
    memset(data, 0, sizeof(data));
}

void sleep(void * p_event_data, uint16_t event_size)
{
    ret_code_t err_code;

    // Stop trigger from starting packet transmission when syncronization is enabled
    ts.m_imu_trigger_enabled = 0;

    // Clear IMU params
    imu_clear_struct(&tms_cfg);

    // Clear all buffers before starting a new measurement
    imu_clear_buff();

    // De-initialize LED
    led_deinit();

    // Stop ts timer - otherwise when timesync packets are enabled and peripheral goes to sleep, there will be an event generated in 10 sec re-enabling the TimeSync receiver
    ts_timer_stop();

    // Disable time synchronization
    err_code = ts_disable();
    APP_ERROR_CHECK(err_code);

    // err_code = ts_deinit();
    // APP_ERROR_CHECK(err_code);

    // Attempt to busy wait until timeslot is closed
    do{
        // NRF_LOG_INFO("ts_timeslot_open");
        // NRF_LOG_FLUSH();
        idle_state_handle(); // Sleep while waiting
    }
    while( ts_timeslot_open() == 1 );
    NRF_LOG_INFO("ts timeslot closed");
    NRF_LOG_FLUSH();

    // Stop advertising - otherwise, a new connection will be made
    // When waking up from IMU WoM interrupt, we need to start advertising again
    advertising_stop();
    NRF_LOG_INFO("advertising_stop");
    NRF_LOG_FLUSH();

    // When in calibration mode - exit calibration mode when going to sleep
    stop_calibration_timer();

    // Shutdown IMU and enable WoM
    imu_sleep_wom();
    NRF_LOG_INFO("imu_sleep_wom");
    NRF_LOG_FLUSH();

    // Shutdown ADC
    usr_adc_deinit();
    NRF_LOG_INFO("usr_adc_deinit");
    NRF_LOG_FLUSH();

    NRF_LOG_INFO("Ready to go to sleep!");
    NRF_LOG_FLUSH();
}




/**@brief Function for handling BLE events.
 *
 * @param[in]   p_ble_evt   Bluetooth stack event.
 * @param[in]   p_context   Unused.
 */
static void ble_evt_handler(ble_evt_t const * p_ble_evt, void * p_context)
{
    ret_code_t err_code;

    // Pass softdevice calls back to TMS handler
    ble_tms_on_ble_evt(&m_tms, p_ble_evt);

    switch (p_ble_evt->header.evt_id)
    {
        case BLE_GAP_EVT_CONNECTED:
            NRF_LOG_INFO("Connected");
            err_code = bsp_indication_set(BSP_INDICATE_CONNECTED);
            APP_ERROR_CHECK(err_code);
            m_conn_handle = p_ble_evt->evt.gap_evt.conn_handle;
            err_code = nrf_ble_qwr_conn_handle_assign(&m_qwr, m_conn_handle);
            APP_ERROR_CHECK(err_code);

            // Set transmit power to +4dBm
            err_code = sd_ble_gap_tx_power_set(BLE_GAP_TX_POWER_ROLE_CONN, m_conn_handle, RADIO_TXPOWER_TXPOWER_Pos4dBm);
            APP_ERROR_CHECK(err_code);
            
            break;

        case BLE_GAP_EVT_DISCONNECTED:
            NRF_LOG_INFO("Disconnected");
            // LED indication will be changed when advertising starts.
            m_conn_handle = BLE_CONN_HANDLE_INVALID;

            err_code = app_sched_event_put(0, 0, sleep);
            APP_ERROR_CHECK(err_code);

            break;

        case BLE_GAP_EVT_PHY_UPDATE_REQUEST:
        {
            NRF_LOG_DEBUG("PHY update request.");
            ble_gap_phys_t const phys =
            {
                .rx_phys = BLE_GAP_PHY_AUTO,
                .tx_phys = BLE_GAP_PHY_AUTO,
            };
            err_code = sd_ble_gap_phy_update(p_ble_evt->evt.gap_evt.conn_handle, &phys);
            APP_ERROR_CHECK(err_code);
        } break;

        case BLE_GAP_EVT_SEC_PARAMS_REQUEST:
            // Pairing not supported
            err_code = sd_ble_gap_sec_params_reply(m_conn_handle, BLE_GAP_SEC_STATUS_PAIRING_NOT_SUPP, NULL, NULL);
            APP_ERROR_CHECK(err_code);
            break;

        case BLE_GATTS_EVT_SYS_ATTR_MISSING:
            // No system attributes have been stored.
            err_code = sd_ble_gatts_sys_attr_set(m_conn_handle, NULL, 0, 0);
            APP_ERROR_CHECK(err_code);
            break;

        case BLE_GATTC_EVT_TIMEOUT:
            // Disconnect on GATT Client timeout event.
            err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gattc_evt.conn_handle,
                                             BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            APP_ERROR_CHECK(err_code);
            break;

        case BLE_GATTS_EVT_TIMEOUT:
            // Disconnect on GATT Server timeout event.
            err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gatts_evt.conn_handle,
                                             BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            APP_ERROR_CHECK(err_code);
            break;

        default:
            // No implementation needed.
            break;
    }
}


/**@brief Function for the SoftDevice initialization.
 *
 * @details This function initializes the SoftDevice and the BLE event interrupt.
 */
static void ble_stack_init(void)
{
    ret_code_t err_code;

    err_code = nrf_sdh_enable_request();
    APP_ERROR_CHECK(err_code);

    // Configure the BLE stack using the default settings.
    // Fetch the start address of the application RAM.
    uint32_t ram_start = 0;
    err_code = nrf_sdh_ble_default_cfg_set(APP_BLE_CONN_CFG_TAG, &ram_start);
    APP_ERROR_CHECK(err_code);

    // CHANGES
    // Configure BLE buffer: store more packets than usable in one connection interval in BLE buffer.
    ble_cfg_t ble_cfg;

    memset(&ble_cfg, 0, sizeof ble_cfg);
    ble_cfg.conn_cfg.conn_cfg_tag                     = APP_BLE_CONN_CFG_TAG;
    ble_cfg.conn_cfg.params.gatts_conn_cfg.hvn_tx_queue_size = 20;              // Change hvn_tx_queue_size to 20: now we have the ability to queue up to 20 packets
    err_code = sd_ble_cfg_set(BLE_CONN_CFG_GATTS, &ble_cfg, ram_start);
    APP_ERROR_CHECK(err_code);
    NRF_LOG_INFO("sd_ble_cfg_set err_code: %d", err_code);

    // Enable BLE stack.
    err_code = nrf_sdh_ble_enable(&ram_start);
    APP_ERROR_CHECK(err_code);

    // Register a handler for BLE events.
    NRF_SDH_BLE_OBSERVER(m_ble_observer, APP_BLE_OBSERVER_PRIO, ble_evt_handler, NULL);
}


/**@brief Function for handling events from the GATT library. */
void gatt_evt_handler(nrf_ble_gatt_t * p_gatt, nrf_ble_gatt_evt_t const * p_evt)
{
    NRF_LOG_DEBUG("ATT MTU exchange completed. central 0x%x peripheral 0x%x",
                  p_gatt->att_mtu_desired_central,
                  p_gatt->att_mtu_desired_periph);
		
    // Added//
    if ((m_conn_handle == p_evt->conn_handle) && (p_evt->evt_id == NRF_BLE_GATT_EVT_ATT_MTU_UPDATED))
    {
        NRF_LOG_INFO("MTU size is set to 0x%X(%d)", p_evt->params.att_mtu_effective, p_evt->params.att_mtu_effective);
    }

    if ((m_conn_handle == p_evt->conn_handle) && (p_evt->evt_id == NRF_BLE_GATT_EVT_DATA_LENGTH_UPDATED))
    {
         NRF_LOG_INFO("LL packet size is set to %d", p_gatt->data_length);
    }
}


