jonacappelle/nRF52-BLE-IMU/BLE/usr_ble.c
/**@brief Function for initializing the GATT library. */
void gatt_init(void)
{
    ret_code_t err_code;

    err_code = nrf_ble_gatt_init(&m_gatt, gatt_evt_handler);
    APP_ERROR_CHECK(err_code);

    err_code = nrf_ble_gatt_att_mtu_periph_set(&m_gatt, NRF_SDH_BLE_GATT_MAX_MTU_SIZE); // 247 max size
    APP_ERROR_CHECK(err_code);
}

void ts_imu_trigger_enable(void)
{
    NRF_LOG_INFO("ts_imu_trigger_enable()");

    uint64_t time_now_ticks;
    uint32_t time_now_msec;
    uint32_t time_target;
    ret_code_t err_code;

    if (ts.m_imu_trigger_enabled)
    {
        return;
    }

    // Round up to nearest second to next 2000 ms to start toggling.
    // If the receiver has received a valid sync packet within this time, the GPIO toggling polarity will be the same.
    // If Sync packet is received within this timestamp - the peripherals will trigger at the same time.

    time_now_ticks = ts_timestamp_get_ticks_u64();
    time_now_msec = TIME_SYNC_TIMESTAMP_TO_USEC(time_now_ticks) / 1000;

    time_target = TIME_SYNC_MSEC_TO_TICK(time_now_msec) + (2000 * 2);
    time_target = (time_target / 2000) * 2000;

    err_code = ts_set_trigger(time_target, nrf_gpiote_task_addr_get(NRF_GPIOTE_TASKS_OUT_3));
    APP_ERROR_CHECK(err_code);

    nrf_gpiote_task_set(NRF_GPIOTE_TASKS_CLR_3);

    ts.m_imu_trigger_enabled = true;
}

static void ts_imu_trigger_disable(void)
{
    NRF_LOG_INFO("ts_imu_trigger_disable()");
    ts.m_imu_trigger_enabled = false;
}

void timesync_pin_toggle(uint32_t tick)
{
    // Toggle on multiples of 100 ticks
    if( (tick % 1000) == 0)
    {
        led_toggle();
    }
}


static void ts_evt_synchronized_enable()
{
    ts.m_ts_synchronized = 1;
}

static void ts_evt_synchronized_disable()
{
    ts.m_ts_synchronized = 0;
}

static bool ts_evt_synchronized()
{
    return ts.m_ts_synchronized;
}

void TimeSync_re_enable()
{
    ret_code_t err_code;

    err_code =  ts_re_enable(&rf_config);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_INFO("ts_re_enable");
}

void TimeSync_enable()
{
    ret_code_t err_code;

    err_code =  ts_enable(&rf_config);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_INFO("ts_enable");
}


static void ts_evt_callback(const ts_evt_t* evt)
{
    // NRF_LOG_INFO("ts_evt_callback");

    APP_ERROR_CHECK_BOOL(evt != NULL);

    ret_code_t err_code;

    switch (evt->type)
    {
        case TS_EVT_SYNCHRONIZED:
            NRF_LOG_INFO("TS_EVT_SYNCHRONIZED");
            NRF_LOG_FLUSH();
            // ts_imu_trigger_enable();
            ts_evt_synchronized_enable();

            uint64_t time_now_ticks;
            uint32_t time_now_msec;

            time_now_ticks = ts_timestamp_get_ticks_u64();
            time_now_msec = TIME_SYNC_TIMESTAMP_TO_USEC(time_now_ticks) / 1000;

            uint32_t time_target;
            time_target = TIME_SYNC_MSEC_TO_TICK(time_now_msec) + 100;
            time_target = (time_target / 100) * 100;

            err_code = ts_set_trigger(time_target, nrf_gpiote_task_addr_get(NRF_GPIOTE_TASKS_OUT_3));
            APP_ERROR_CHECK(err_code);

            // Let DCU know to state of sync of different sensors
            sync_info_send(true);

            break;
        case TS_EVT_DESYNCHRONIZED:
            NRF_LOG_INFO("TS_EVT_DESYNCHRONIZED");
            led_off();
            ts_imu_trigger_disable();
            ts_evt_synchronized_disable();

            // Let DCU know to state of sync of different sensors
            sync_info_send(false);
            
            break;
        case TS_EVT_SYNC_PACKET_RECEIVED:
            NRF_LOG_INFO("TS_EVT_SYNC_PACKET_RECEIVED");

            // Temp disable TimeSync for x seconds to disable power
            do{
                err_code = ts_temp_disable();
                
                // Problem here: Receiver can't be disabled when it's already disabled
                // NRF_ERROR_FORBIDDEN when this happens, just neglect this error code and we will be fine
                if(err_code != NRF_ERROR_BUSY && err_code != NRF_ERROR_FORBIDDEN) APP_ERROR_CHECK(err_code);
            }while(err_code == NRF_ERROR_BUSY);

            ts_start_idle_timer(30);

            break;
        case TS_EVT_TRIGGERED:
            // NRF_LOG_INFO("TS_EVT_TRIGGERED");
            {
                uint32_t tick_target;

                if (ts.m_imu_trigger_enabled && ts_evt_synchronized())
                {
                    tick_target = evt->params.triggered.tick_target + ts.sync_interval_int_time;
                    // NRF_LOG_INFO("ts.sync_interval_int_time: %d", ts.sync_interval_int_time);

                    uint32_t time;
                    time = TIME_SYNC_TIMESTAMP_TO_USEC(tick_target) / 1000;

                    ret_code_t err_code = ts_set_trigger(tick_target, nrf_gpiote_task_addr_get(NRF_GPIOTE_TASKS_OUT_3));
                    if(err_code != NRF_SUCCESS)
                    {
                        NRF_LOG_INFO("err_code: %d", err_code);
                    }
                    APP_ERROR_CHECK(err_code);

                    uint64_t time_now_ticks;
                    uint32_t time_now_msec;
                    time_now_ticks = TIME_SYNC_MSEC_TO_TICK(TIME_SYNC_TIMESTAMP_TO_USEC(ts_timestamp_get_ticks_u64()));

                    // Check for wrong timesync packet
                    if(tick_target <= (time_now_ticks/1000))
                    {
                        tick_target = evt->params.triggered.tick_target + ts.sync_interval_int_time;
                        NRF_LOG_INFO("TimeSync tick_target <= ticks_now");
                    }
                    // Print Time - Last Sync
                    // NRF_LOG_INFO("now   %d  tick_target  %d  last_sync   %d", time_now_ticks/1000, evt->params.triggered.tick_target, evt->params.triggered.last_sync);

                    // Toggle LED to measure TimeSync
                    timesync_pin_toggle(tick_target);

                    // Convert sample time of IMU packet to ms
                    // imu_sample_time_tick => ticks since start of measurement
                    uint64_t imu_sample_time_ms = evt->params.triggered.tick_target - data_sampling_time_start;


                    // Process IMU BLE packet for sending
                    imu_send_data(&tms_cfg, (uint32_t) imu_sample_time_ms);

                    // NRF_LOG_INFO("tick target: %d", evt->params.triggered.tick_target);
                    // NRF_LOG_INFO("start tick: %d", data_sampling_time_start);

                    // NRF_LOG_INFO("time: %d", imu_sample_time_ms);

