jonacappelle/nRF52-BLE-IMU/BLE/usr_ble.c
                }
                else if (ts_evt_synchronized()) // When synchronized but not yet measuring
                {

                    // NRF_LOG_INFO("Synchronized LED toggle");

                    tick_target = evt->params.triggered.tick_target + 100;

                    ret_code_t err_code = ts_set_trigger(tick_target, nrf_gpiote_task_addr_get(NRF_GPIOTE_TASKS_OUT_3));
                    if(err_code != NRF_SUCCESS)
                    {
                        NRF_LOG_INFO("err_code: %d", err_code);
                    }
                    APP_ERROR_CHECK(err_code);

                    // Only toggle LED when calibration is not running
                    if(!calibration_timer_running)
                    {
                        led_toggle();
                    }


                }
                else
                {
                    // Ensure pin is low when triggering is stopped
                    nrf_gpiote_task_set(NRF_GPIOTE_TASKS_CLR_3);

                    // Set pin low when triggering is stopped
                    led_off();

                    NRF_LOG_INFO("Triggering stopped");
                }
            }
            break;
        default:
            APP_ERROR_CHECK_BOOL(false);
            break;
    }
}

void sync_timer_init(void)
{
    ret_code_t err_code;

    // Debug pin:
    // nRF52-DK (PCA10040) Toggle P0.24 from sync timer to allow pin measurement
    // nRF52840-DK (PCA10056) Toggle P1.14 from sync timer to allow pin measurement
#if defined(BOARD_PCA10040)
    nrf_gpiote_task_configure(3, NRF_GPIO_PIN_MAP(0, 24), NRF_GPIOTE_POLARITY_TOGGLE, NRF_GPIOTE_INITIAL_VALUE_LOW);
    nrf_gpiote_task_enable(3);
#elif defined(BOARD_PCA10056)
    nrf_gpiote_task_configure(3, NRF_GPIO_PIN_MAP(1, 14), NRF_GPIOTE_POLARITY_TOGGLE, NRF_GPIOTE_INITIAL_VALUE_LOW);
    nrf_gpiote_task_enable(3);
#else
#warning Debug pin not set
#endif

    ts_init_t init_ts =
    {
        .high_freq_timer[0] = NRF_TIMER3,
        .high_freq_timer[1] = NRF_TIMER4,
        .egu                = NRF_EGU3,
        .egu_irq_type       = SWI3_EGU3_IRQn,
        .evt_handler        = ts_evt_callback,
    };

    err_code = ts_init(&init_ts);
    APP_ERROR_CHECK(err_code);

    err_code = ts_enable(&rf_config);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_INFO("Started listening for beacons.");
}




/**@brief Function for handling events from the BSP module.
 *
 * @param[in]   event   Event generated by button press.
 */
void bsp_event_handler(bsp_event_t event)
{
    ret_code_t err_code;
    switch (event)
    {
        case BSP_EVENT_KEY_0:
            NRF_LOG_INFO("Key pressed");

            break;

        case BSP_EVENT_KEY_2:
        {
            // Print syncrhonized timestamp
            ts_print_sync_time();
            break;
        }
						
        case BSP_EVENT_SLEEP:
            sleep_mode_enter();
            break;

        case BSP_EVENT_DISCONNECT:
            err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            if (err_code != NRF_ERROR_INVALID_STATE)
            {
                APP_ERROR_CHECK(err_code);
            }
            break;

        case BSP_EVENT_WHITELIST_OFF:
            if (m_conn_handle == BLE_CONN_HANDLE_INVALID)
            {
                err_code = ble_advertising_restart_without_whitelist(&m_advertising);
                if (err_code != NRF_ERROR_INVALID_STATE)
                {
                    APP_ERROR_CHECK(err_code);
                }
            }
            break;

        default:
            break;
    }
}


/**@brief Function for initializing the Advertising functionality.
 */
void advertising_init(void)
{
    uint32_t               err_code;
    ble_advertising_init_t init;

    memset(&init, 0, sizeof(init));

    // CHANGES
    init.advdata.name_type          = BLE_ADVDATA_FULL_NAME;
    init.advdata.include_appearance = false;
    init.advdata.flags              = BLE_GAP_ADV_FLAGS_LE_ONLY_LIMITED_DISC_MODE;

    // Costum added for TMS: need to use "uuids_more_available" and scan responce packet "srdata" becaus when advertising both uuids, 
    // the advertising packet length becomes more than 31 (which is the max length)
    init.advdata.uuids_more_available.uuid_cnt = 1;
    init.advdata.uuids_more_available.p_uuids = &m_adv_uuids[0];

    // ble_advdata_t srdata;

    // init.srdata.uuids_more_available.uuid_cnt = 2;
    // init.srdata.uuids_more_available.p_uuids = &m_adv_uuids[1];
    // End Costum

    advertising_config_get(&init.config);

    // init.config.ble_adv_fast_enabled  = true;
    // init.config.ble_adv_fast_interval = APP_ADV_INTERVAL;
    // init.config.ble_adv_fast_timeout  = APP_ADV_DURATION;
    init.evt_handler = on_adv_evt;

    err_code = ble_advertising_init(&m_advertising, &init);
    APP_ERROR_CHECK(err_code);

    ble_advertising_conn_cfg_tag_set(&m_advertising, APP_BLE_CONN_CFG_TAG);
}


/**@brief Function for initializing buttons and leds.
 *
 * @param[out] p_erase_bonds  Will be true if the clear bonding button was pressed to wake the application up.
 */
static void buttons_leds_init(bool * p_erase_bonds)
{
    bsp_event_t startup_event;

    ret_code_t err_code = bsp_init(BSP_INIT_LEDS | BSP_INIT_BUTTONS, bsp_event_handler);
    APP_ERROR_CHECK(err_code);

    err_code = bsp_btn_ble_init(NULL, &startup_event);
    APP_ERROR_CHECK(err_code);

    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}


/**@brief Function for initializing the nrf log module.
 */
void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();

    // Display start message
    NRF_LOG_INFO("Debug logging for UART over RTT started.");

    NRF_LOG_DEBUG("DEBUG enabled in preprocessor");
    NRF_LOG_FLUSH();
}


/**@brief Function for initializing power management.
 */
static void power_management_init(void)
{
    ret_code_t err_code;
    err_code = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for starting advertising.
 */
void advertising_start(void)
{
    ret_code_t err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(err_code);
    NRF_LOG_INFO("advertising_start");
}


void advertising_stop(void)
{   
    // @retval ::NRF_SUCCESS The BLE stack has stopped advertising.
    // @retval ::BLE_ERROR_INVALID_ADV_HANDLE Invalid advertising handle.
    // @retval ::NRF_ERROR_INVALID_STATE The advertising handle is not advertising.
    ret_code_t err_code;

	err_code = sd_ble_gap_adv_stop(m_advertising.adv_handle);
    
