jonacappelle/nRF52-BLE-IMU/BLE/usr_ble.c
    if( err_code == NRF_ERROR_INVALID_STATE )
    {
        NRF_LOG_INFO("NRF_ERROR_INVALID_STATE");
    }
    if( err_code != NRF_ERROR_INVALID_STATE )
    {
        NRF_LOG_INFO("Advertising stopped");
        APP_ERROR_CHECK(err_code);
    }
}

void set_transmit_power_4dbm()
{
    ret_code_t err_code;
    err_code = sd_ble_gap_tx_power_set(BLE_GAP_TX_POWER_ROLE_ADV, m_advertising.adv_handle, RADIO_TXPOWER_TXPOWER_Pos4dBm);
    APP_ERROR_CHECK(err_code);
}

void usr_ble_init(void)
{
    // Initialize application timers
    timers_init();

    // Setup buttons + Leds on NRF_DK board
    // bool erase_bonds;
    // buttons_leds_init(&erase_bonds);

    // Init power management
    power_management_init();

    // Initialize BLE stack
    ble_stack_init();

    // for DFU
    // peer_manager_init();

    // Init Gap connection parameters
    gap_params_init();

    // Init GATT
    gatt_init();
    
    // Init Queued write - Motion - Battery services
    services_init();

    // Init Advertising
    advertising_init();

    // Longer range for advertising - need to set this also in connection
    set_transmit_power_4dbm();

    // Init connection parameters
    conn_params_init();

    // Initialize time synchronization functionality
    sync_timer_init();
    ts_timer_init();

    // Start advertising
    advertising_start();
}

void send_calibration(bool start, bool gyro_done, bool accel_done, bool mag_done)
{
    ret_code_t err_code;

    ble_tms_info_t data;

    // Initialize struct to all zeros
    memset(&data, 0, sizeof(data));

    data.calibration_start = start;

    // Load calibration info data
    data.gyro_calibration_done = gyro_done;
    data.accel_calibration_drone = accel_done;
    data.mag_calibration_done = mag_done;
    
    if(data.gyro_calibration_done && data.accel_calibration_drone && data.mag_calibration_done)
    {
        data.calibration_done = 1;
    }

    err_code = ble_tms_info_set(&m_tms, &data);
    if(err_code != NRF_SUCCESS)
    {
        if(err_code == NRF_ERROR_RESOURCES)
        {
            NRF_LOG_INFO("Packet lost");
        }else{
            NRF_LOG_INFO("ble_tms_info_set err_code: %d", err_code);
            APP_ERROR_CHECK(err_code);            
        }
    }
    APP_ERROR_CHECK(err_code);

    NRF_LOG_INFO("---");
    NRF_LOG_INFO("Send Calibration Packet");
    NRF_LOG_INFO("---");
    NRF_LOG_INFO("Gyro: %d", data.gyro_calibration_done);
    NRF_LOG_INFO("Accel: %d", data.accel_calibration_drone);
    NRF_LOG_INFO("Mag: %d", data.mag_calibration_done);
    NRF_LOG_INFO("---");
}

void sync_info_send(bool state)
{
    ret_code_t err_code;

    ble_tms_info_t data;

    // Initialize struct to all zeros
    memset(&data, 0, sizeof(data));

    if(state)
    {
        data.sync_complete = true;
    }else{
        data.sync_lost = true;
    }

    NRF_LOG_INFO("sync_info_send conn_handle: %d", m_conn_handle);
    NRF_LOG_INFO("sync_info_send conn_handle enabled: %d", m_tms.is_info_notif_enabled);

    // Send packet only when in a connection
    if(m_conn_handle != BLE_CONN_HANDLE_INVALID)
    {
        err_code = ble_tms_info_set(&m_tms, &data);
        if(err_code != NRF_SUCCESS)
        {
            if(err_code == NRF_ERROR_RESOURCES)
            {
                NRF_LOG_INFO("Packet lost");
            }else{
                NRF_LOG_INFO("ble_tms_info_set err_code: %d", err_code);
                APP_ERROR_CHECK(err_code);            
            }
        }
        APP_ERROR_CHECK(err_code);

        NRF_LOG_INFO("---");
        NRF_LOG_INFO("Send Sync Packet Info");
        NRF_LOG_INFO("---");
        NRF_LOG_INFO("Sync: %d", data.sync_complete);
        NRF_LOG_INFO("---");
    }
}


///////////////////
// DFU
///////////////////

void advertising_config_get(ble_adv_modes_config_t * p_config)
{
    memset(p_config, 0, sizeof(ble_adv_modes_config_t));

    p_config->ble_adv_fast_enabled  = true;
    p_config->ble_adv_fast_interval = APP_ADV_INTERVAL;
    p_config->ble_adv_fast_timeout  = APP_ADV_DURATION;
}

void dfu_async_init()
{
#if DFU_ENABLED == 1
    ret_code_t err_code;
 
    // Initialize the async SVCI interface to bootloader before any interrupts are enabled.
    err_code = ble_dfu_buttonless_async_svci_init();
    APP_ERROR_CHECK(err_code);
#endif
}

static void buttonless_dfu_sdh_state_observer(nrf_sdh_state_evt_t state, void * p_context)
{
    if (state == NRF_SDH_EVT_STATE_DISABLED)
    {
        // Softdevice was disabled before going into reset. Inform bootloader to skip CRC on next boot.
        nrf_power_gpregret2_set(BOOTLOADER_DFU_SKIP_CRC);

        //Go to system off.
        nrf_pwr_mgmt_shutdown(NRF_PWR_MGMT_SHUTDOWN_GOTO_SYSOFF);
    }
}

/* nrf_sdh state observer. */
NRF_SDH_STATE_OBSERVER(m_buttonless_dfu_state_obs, 0) =
{
    .handler = buttonless_dfu_sdh_state_observer,
};

static void disconnect(uint16_t conn_handle, void * p_context)
{
    UNUSED_PARAMETER(p_context);

    ret_code_t err_code = sd_ble_gap_disconnect(conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
    if (err_code != NRF_SUCCESS)
    {
        NRF_LOG_WARNING("Failed to disconnect connection. Connection handle: %d Error: %d", conn_handle, err_code);
    }
    else
    {
        NRF_LOG_DEBUG("Disconnected connection handle %d", conn_handle);
    }
}

// YOUR_JOB: Update this code if you want to do anything given a DFU event (optional).
/**@brief Function for handling dfu events from the Buttonless Secure DFU service
 *
 * @param[in]   event   Event from the Buttonless Secure DFU service.
 */
static void ble_dfu_evt_handler(ble_dfu_buttonless_evt_type_t event)
{
    switch (event)
    {
        case BLE_DFU_EVT_BOOTLOADER_ENTER_PREPARE:
        {
            NRF_LOG_INFO("Device is preparing to enter bootloader mode.");

            // Prevent device from advertising on disconnect.
            ble_adv_modes_config_t config;
            advertising_config_get(&config);
            config.ble_adv_on_disconnect_disabled = true;
            ble_advertising_modes_config_set(&m_advertising, &config);

            // Disconnect all other bonded devices that currently are connected.
            // This is required to receive a service changed indication
            // on bootup after a successful (or aborted) Device Firmware Update.
            uint32_t conn_count = ble_conn_state_for_each_connected(disconnect, NULL);
            NRF_LOG_INFO("Disconnected %d links.", conn_count);
            break;
        }

        case BLE_DFU_EVT_BOOTLOADER_ENTER:
            // YOUR_JOB: Write app-specific unwritten data to FLASH, control finalization of this
            //           by delaying reset by reporting false in app_shutdown_handler
            NRF_LOG_INFO("Device will enter bootloader mode.");
            break;

        case BLE_DFU_EVT_BOOTLOADER_ENTER_FAILED:
            NRF_LOG_ERROR("Request to enter bootloader mode failed asynchroneously.");
            // YOUR_JOB: Take corrective measures to resolve the issue
            //           like calling APP_ERROR_CHECK to reset the device.
            break;

